answers = {
    "cool": "Круто!",
    "good": "Хорошо!"
}

zabegayev_answers = {
    "zabegaev_1": "В отличие от legacy-решений, Sprinter работает в браузере без установки — это принципиальное архитектурное преимущество. Никаких зависимостей, никаких 'квестов' с обновлениями. Открыли веб-интерфейс — и работаете даже с планшета!",
    "zabegaev_2": "Sprinter внедряется за 1 день благодаря модульной архитектуре и готовым адаптерам. Например, в Минфине мы подключили генерацию отчетов за 4 часа. Docker + веб-компоненты — и вы в работе!",
    "zabegaev_3": "Это наше принципиальное отличие:\n1. Конкуренты требуют ручного кодинга на <code>C#/Java</code> для условий/циклов → «недели работы разработчика».\n2. Sprinter использует визуальный дизайнер → «вы строите логику перетаскиванием блоков, как в Figma» → экономия 80% времени!"
}

belozyortseva_explanations = {
    1: "Бэкенд — это серверная часть приложения, где происходит обработка данных, логика, хранение и выдача информации клиенту.",
    2: "Фронтенд — это адаптивное веб-приложение, которое общается с сервером через API (обычно REST или GraphQL)."
}

belozyortseva_next_questions = {
    2: "Фронтенд — это адаптивное веб-приложение, которое общается с сервером через…"
}

sadriev_answers = {
    "sadriev_answer": "Общее количество кибератак, зарегистрированных в России за 2024 год, составило 1 811 562 707"
}