answers = {
    "cool": "Круто",
    "bore": "Скучаю"
}

zabegayev_answers = {
    "zabegaev_1": {
        "correct": "✅ <b>Верно.\nSprinter работает в браузере без всяких установок</b> — это ключевая архитектурная фишка.",
        "incorrect": "❌ <b>Не так.</b>\n<b>Sprinter НЕ требует</b> установки — <b>он браузерный.</b>\n\n<i>Это и есть его архитектурное преимущество: <b>меньше головной боли с техподдержкой, быстрее внедрение.</b>\nВеб-интерфейс работает хоть с планшета.</i>"
    },
    "zabegaev_2": {
        "correct": "✅ <b>Верно:</b> <u>это правда.</u>\n\n<i>Визуальный дизайнер Sprinter заменяет код перетаскиванием блоков — экономия 80% времени</i>",
        "incorrect": "❌ <b>Мимо:</b> <u>Sprinter как раз умеет создавать сложные документы с таблицами и условиями без программирования — всё через интуитивный визуальный конструктор.</u>"
    }
}

belozyortseva_explanations = {
    1: {
        "correct": "✅ <b>Да, всё верно, молодец.</b>\n\nБэкенд сервиса делится на ядро и приложение, что позволяет разделять бизнес-логику от интеграционной части с системами.",
        "incorrect": "❌ <b>Неверный ответ.</b>\n\nНа самом деле бэкенд сервиса состоит из двух главных частей — ядра и приложения. Такой подход помогает отделять бизнес-логику от интеграций с другими системами 🤓"
    },
    2: {
        "correct": "✅ <b>Да, точно!</b>\n\n<i>Фронтенд — это адаптивное веб-приложение, и с бэкендом оно взаимодействует только через API</i>",
        "incorrect": "❌ <b>Не то.</b>\n\n<i>Фронтенд общается с сервером <b>исключительно через API</b></i>"
    }
}

belozyortseva_next_questions = {
    2: "Фронтенд — это адаптивное веб-приложение, которое общается с сервером через…"
}

sadriev_answers = {
    "correct": "✅ <b>Да, точно.</b>\nВ 2024 году зафиксировано <b>1 811 562 707 кибератак.</b>\n<i>Цифра внушительная — и +1 балл в твой рейтинг 🎯</i>",
    "incorrect": "❌ Не угадал, но теперь знаешь.\nПравильный ответ: <b>1 811 562 707 атак за 2024 год.</b>\n\n<i>Двигаемся дальше</i>"
}