interactive_messages = {
    "admakin": {
        "start": "Так. Теперь обещанный интерактив по теме.\n\n<b>▶️ Нажимай на кнопку</b> — я запущу тебе задание.",
        "end": "💬 <i>Если что — <b>материалы</b> Дмитрия Адмакина <b>уже в easy</b>, ты сможешь его пересмотреть.</i>"
    },
    "balukov": {
        "start": "Так. Теперь обещанный интерактив по теме.\n\n<b>▶️ Нажимай на кнопку</b> — я запущу тебе задание.",
        "end": "💬 <i>Если что — <b>материалы</b> Александра Балукова <b>уже в easy</b>, ты сможешь его пересмотреть.</i>"
    },
    "belozertseva": {
        "start": "Так. Теперь обещанный интерактив по теме.\n\n<b>▶️ Нажимай на кнопку</b> — я запущу тебе задание.",
        "end": "💬 <i>Если что — <b>материалы</b> Анастасии Белозерцевой <b>уже в <a href='https://t.me/Easyontelegram_bot?startapp=courses_bc69287c-b6e4-4e85-804c-628b63778891'>easy</a></b>, ты сможешь его пересмотреть.</i>"
    },
    "gavrikov": {
        "start": "Так. Теперь обещанный интерактив по теме.\n\n<b>▶️ Нажимай на кнопку</b> — я запущу тебе задание.",
        "end": "💬 <i>Если что — <b>материалы</b> Антона Гаврикова <b>уже в easy</b>, ты сможешь его пересмотреть.</i>"
    },
    "zabegaev": {
        "start": "Так. Теперь обещанный интерактив по теме.\n\n<b>▶️ Нажимай на кнопку</b> — я запущу тебе задание.",
        "end": "💬 <i>Если что — <b>материалы</b> Станислава Забегаева <b>уже в easy</b>, ты сможешь его пересмотреть.</i>"
    },
    "mendubaev": {
        "start": "Так. Теперь обещанный интерактив по теме.\n\n<b>▶️ Нажимай на кнопку</b> — я запущу тебе задание.",
        "end": "💬 <i>Если что — <b>материалы</b> Рима Мендубаева <b>уже в easy</b>, ты сможешь его пересмотреть.</i>"
    },
    "nurhametova": {
        "start": "Так. Теперь обещанный интерактив по теме.\n\n<b>▶️ Нажимай на кнопку</b> — я запущу тебе задание.",
        "end": "💬 <i>Если что — <b>материалы</b> Асель Нурхаметовой <b>уже в easy</b>, ты сможешь его пересмотреть.</i>"
    },
    "sadriev": {
        "start": "Так. Теперь обещанный интерактив по теме.\n\n<b>▶️ Нажимай на кнопку</b> — я запущу тебе задание.",
        "end": "💬 <i>Если что — <b>материалы</b> Тимура Садриева <b>уже в easy</b>, ты сможешь его пересмотреть.</i>"
    },
    "horoshutina": {
        "start": "Так. Теперь обещанный интерактив по теме.\n\n<b>▶️ Нажимай на кнопку</b> — я запущу тебе задание.",
        "end": "💬 <i>Если что — <b>материалы</b> Юлии Хорошутиной <b>уже в easy</b>, ты сможешь его пересмотреть.</i>"
    },
    "gilmanova": {
        "end": "💬 <i>Если что — <b>материалы</b> Эльвиры Гильмановой <b>уже в easy</b>, ты сможешь его пересмотреть.</i>"
    }
}

performance_start_messages = {
    "belozertseva": "🎤 <b>Анастасия Белозерцева</b> (руководитель группы отдела разработки системы \"Электронная школа\") уже вышла на сцену с темой: \"<b>Веб.Фонд учёта учебной литературы</b>\"\nЕсли планировал послушать — лучше поскорее присоединиться.",
    
    "mendubaev": "🎤 <b>Рим Мендубаев</b> (руководитель группы общесистемной разработки) уже вышел на сцену с темой: \"<b>Соглант: сервис электронного согласования документов</b>\"\nЕсли планировал послушать — лучше поскорее присоединиться.",
    
    "balukov": "🎤 <b>Александр Балуков</b> (руководитель отдела разработки ЛИС) уже вышел на сцену с темой: \"<b>ЛИС 2.0: цифровая трансформация лабораторной диагностики</b>\"\nЕсли планировал послушать — лучше поскорее присоединиться.",
    
    "gavrikov": "🎤 <b>Антон Гавриков</b> (руководитель группы отдела разработки) уже вышел на сцену с темой: \"<b>ЕИРЦМ - что это и для чего он нужен?</b>\"\nЕсли планировал послушать — лучше поскорее присоединиться.",
    
    "zabegaev": "🎤 <b>Станислав Забегаев</b> (Директор БЦ) уже вышел на сцену с темой: \"<b>Спринтер: создание отчетов и документов без лишней рутины</b>\"\nЕсли планировал послушать — лучше поскорее присоединиться.",
    
    "nurhametova": "🎤 <b>Асель Нурхаметова</b> (руководитель отдела аналитики) уже вышла на сцену с темой: \"<b>Создание системы для Уполномоченного по правам человека Российской Федерации — Татьяны Николаевны Москальковой</b>\"\nЕсли планировал послушать — лучше поскорее присоединиться.",
    
    "admakin": "🎤 <b>Дмитрий Адмакин</b> (руководитель отдела архитектурных решений и перспективной разработки) уже вышел на сцену с темой: \"<b>Эволюция NXTCore: от ядра до умной low-code платформы NXTCode с ИИ</b>\"\nЕсли планировал послушать — лучше поскорее присоединиться.",
    
    "sadriev": "🎤 <b>Тимур Садриев</b> (руководитель отдела внутренней автоматизации, директор БЦ BARS.Up AM) уже вышел на сцену с темой: \"<b>BarsUP.Access Manager 2.0: безопасный доступ нового поколения</b>\"\nЕсли планировал послушать — лучше поскорее присоединиться.",
        
    "horoshutina": "🎤 <b>Юлия Хорошутина</b> (маркетолог) уже вышла на сцену с темой: \"<b>Продуктовый подход в БЦ BI/AlphaBI</b>\"\nЕсли планировал послушать — лучше поскорее присоединиться.",
    
    "gilmanova": "🎤 <b>Эльвира Гильманова</b> (заместитель генерального директора) уже вышла на сцену с темой: \"<b>От стартапа до бизнеса за 1825 дней</b>\"\nЕсли планировал послушать — лучше поскорее присоединиться."
}

def get_interactive_message(speaker_name: str, message_type: str) -> str:
    """Получает сообщение для интерактива спикера"""
    if speaker_name in interactive_messages:
        return interactive_messages[speaker_name].get(message_type, f"Сообщение для {speaker_name}")
    if message_type == "start":
        return f"🔴 Начинается интерактив от {speaker_name}!"
    else:
        return f"✅ {speaker_name} завершил(а) выступление."


def get_performance_start_message(speaker_name: str) -> str:
    """Получает сообщение о начале выступления спикера"""
    return performance_start_messages.get(speaker_name, f"🎤 {speaker_name} уже вышел на сцену!\nЕсли планировал послушать — лучше поскорее присоединиться.") 


def get_feedback_message(interactive_name: str) -> str:
    """Возвращает персонализированное сообщение для спикера"""
    speaker_messages = {
        "belozertseva": "Принято! Передам обратную связь Анастасии.",
        "admakin": "Принято! Передам обратную связь Дмитрию.",
        "balukov": "Принято! Передам обратную связь Александру.",
        "gavrikov": "Принято! Передам обратную связь Антону.",
        "zabegaev": "Принято! Передам обратную связь Станиславу.",
        "mendubaev": "Принято! Передам обратную связь Риму.",
        "nurhametova": "Принято! Передам обратную связь Асель.",
        "sadriev": "Принято! Передам обратную связь Тимуру.",
        "horoshutina": "Принято! Передам обратную связь Юлии.",
        "gilmanova": "Принято! Передам обратную связь Эльвире."
    }
    return speaker_messages.get(interactive_name, "Спасибо за обратную связь, учтём!")