nurkhametova_text = [
    {
        "text": "После развода отец запрещает матери видеться с ребёнком без причины. Это ущемляет _____ родителя",
        "correct": "true",
        "wrong_feedback": None
    },
    {
        "text": "Мигранта депортировали, не дав возможности обжаловать решение. Какое право нарушено?",
        "correct": "true",
        "wrong_feedback": "Неверно! Это нарушение права на справедливый суд (ст. 46 Конституции)."
    },
    {
        "text": "Не предоставили ребёнку место в детском садике. Какое право нарушено?",
        "correct": "true",
        "wrong_feedback": "Неверно! Это относится к социальным правам, а не к гражданским или образовательным."
    },
    {
        "text": "Соседи по ночам шумят, нарушаются — ________",
        "correct": "true",
        "wrong_feedback": "Неверно! Это административные права — шум по ночам регулируется через КоАП."
    }
]