# Пояснения для каждого шага теста
explanations = {
    "menu": "Cемейные права включают право родителей и детей на общение и участие в воспитании (ст. 55 Семейного кодекса РФ).",
    "start": "Право на справедливый суд — это возможность обжаловать решения государственных органов (ст. 46 Конституции РФ).",
    "start1": "Социальное право гарантирует доступ к социальным услугам, включая образование и место в детском саду.",
    "start2": "Административные права обеспечивают защиту граждан от произвольных действий органов власти, например, незаконной депортации."
}