explanations = {
    "question_1": "Cемейные права включают право родителей и детей на общение и участие в воспитании (ст. 55 Семейного кодекса РФ).",
    "question_2": "Право на справедливый суд — это возможность обжаловать решения государственных органов (ст. 46 Конституции РФ).",
}

buttons_1 = {
        "Cемейные права": "nurkhametova_question_1_0",
        "Гражданские права": "nurkhametova_question_1_1", 
        "Административные права": "nurkhametova_question_1_2"
    }

buttons_2 = {
    "Право на справедливый суд (ст. 46 Конституции)": "nurkhametova_question_2_0",
    "Гражданское право": "nurkhametova_question_2_1",
    "Право на предпринимательство": "nurkhametova_question_2_2"
}