first_part = (
    "<b>Welcome на ТЕХНОБАРС 👋</b>\n"
    "И сегодня мы проведем день вместе.\n\n"
    "<b>Я помогу тебе</b> не потеряться в расписании, сориентироваться по спикерам и полезному материалу, "
    "ну и, возможно, даже \n<span class=\"tg-spoiler\">выиграть приз от организаторов 🎁</span>\n"
    "Но главное всё-таки — <b>навигация</b> 🧭\n\n"
    "<i>Так что, будем знакомы!</i>"
)

second_part = (
    "<b>Плюс будут задания.</b>\n"
    "В основном по темам выступлений — <i>они простые, но нужно быть внимательным</i> 👀\n\n"
    "Выполнение даёт баллы. За баллы — призы. Всё просто 💡"
)

third_part = (
    "<b>Первое, в чём я тебе помогу — расскажу, кто сегодня на сцене</b>\n"
    "<i>(сохрани себе, пригодится):</i>\n\n"
    "▪️ <b>Анастасия Белозёрова</b> (БЦ ОБР) — как системно учитывать учебники\n"
    "▪️ <b>Рим Мендубаев</b> (БЦ ОБП) — электронное согласование в реальности\n"
    "▪️ <b>Тимур Садриев</b> (BARS.UP) — доступ и безопасность без головняка\n"
    "▪️ <b>Дмитрий Адмакин</b> (БЦ ОПР) — NXTCore и ИИ на практике, а не на презентации\n"
    "▪️ <b>Асель Нурмухаметова</b> (БЦ Росстат) — кейс для Уполномоченного по правам человека\n"
    "▪️ <b>Александр Балуков</b> (БЦ Медицина) — цифровая лаборатория, не миф, а продукт\n"
    "▪️ <b>Юлия Хорошутина</b> (AlphaBI) — продуктовый подход, если без воды\n"
    "▪️ <b>Станислав Забегаев</b> (БЦ УНП) — отчёты и документы — быстро и без боли\n"
    "▪️ <b>Антон Гавриков</b> (БЦ ЖКХ) — зачем вообще этот ЕИРЦМ\n"
    "▪️ <b>Эльвира Гильманова</b> — как за 1825 дней из идеи сделать бизнес"
)

fourth_part = (
    "<b>Кстати, у меня уже есть:</b>\n\n"
    "🗂 <b>Программа по спикерам</b>\n"
    "🔎 <b>Навигатор</b>\n"
    "⏱️ <b>Таймеры</b>, чтобы не залипнуть и не пропустить то, что может пригодиться"
)

fifth_part = (
    "<b>Всё. <i>Жди первое включение — и не теряйся</i></b>🫰"
)
