first_part = (
    "<b>Добро пожаловать на ТЕХНОБАРС 👋</b>\n"
    "<i>Сегодня я помогу тебе не потеряться в расписании, сориентироваться по спикерам и полезным материалам.</i>\n"
    "А ещё…\n"
    "<b>выиграть барскоины 🎁</b>\n"
    "<i>Но главное всё-таки — навигация 🧭</i>\n"
    "<b>Ну что, будем знакомы!</b>"
)

second_part = (
    "<b>Во время выступлений будут задания.</b>\n"
    "<i>В основном по темам выступлений — они простые, но нужно быть внимательным 👀</i>\n\n"
    "<b>Выполнение даёт баллы. За баллы — барскоины. Всё просто 💡</b>\n"
    "<i>Первое, в чём я тебе помогу — расскажу, кто сегодня на сцене</i>\n"
    "<i>(сохрани себе, пригодится)</i>"
)

third_part = (
    "<b>🎤 Спикеры дня:</b>\n"
    "—  <b>Анастасия Белозёрова</b> (БЦ ОБР) — как системно учитывать учебники\n"
    "— <b>Рим Мендубаев</b> (БЦ ОБП) — электронное согласование в реальности\n"
    "— <b>Тимур Садриев</b> (BARS.UP) — доступ и безопасность без головняка\n"
    "— <b>Дмитрий Адмакин</b> (БЦ ОПР) — NXTCore и ИИ на практике, а не на презентации\n"
    "— <b>Асель Нурмухаметова</b> (БЦ Росстат) — кейс для Уполномоченного по правам человека\n"
    "— <b>Александр Балуков</b> (БЦ Медицина) — цифровая лаборатория, не миф, а продукт\n"
    "— <b>Юлия Хорошутина</b> (AlphaBI) — продуктовый подход, если без воды\n"
    "— <b>Станислав Забегаев</b> (БЦ УНП) — отчёты и документы — быстро и без боли\n"
    "— <b>Антон Гавриков</b> (БЦ ЖКХ) — зачем вообще этот ЕИРЦМ\n"
    "— <b>Эльвира Гильманова</b> — как за 1825 дней из идеи сделать бизнес"
)

fourth_part = (
    "<b>Всё. Жди первое включение — и не теряйся</b>🫰"
)
