first_part = (
    "<b>Добро пожаловать на ТЕХНОБАРС 👋</b>\n"
    "<i>Сегодня я помогу тебе не потеряться в расписании, сориентироваться по спикерам и полезным материалам.</i>\n"
    "А ещё…\n"
    "<b><span class='tg-spoiler'>выиграть барскоины 🎁</span></b>\n"
    "<i>Но главное всё-таки — навигация 🧭</i>\n"
    "<b>Ну что, будем знакомы!</b>"
)

second_part = (
    "<b>Во время выступлений будут задания.</b>\n"
    "<i>В основном по темам выступлений — они простые, но нужно быть внимательным 👀</i>\n\n"
    "<b>Выполнение даёт баллы. За баллы — барскоины. Всё просто 💡</b>\n"
    "<i>Первое, в чём я тебе помогу — расскажу, кто сегодня на сцене</i>\n"
    "<i>(сохрани себе, пригодится)</i>"
)

third_part = (
    "<b>🎤 Спикеры дня:</b>\n"
    "— <b>Анастасия Белозёрова</b> <i>(БЦ ОБР): как системно учитывать учебники</i>\n"
    "— <b>Рим Мендубаев</b> <i>(БЦ ОБП): электронное согласование без хаоса</i>\n"
    "— <b>Тимур Садриев</b> <i>(ОВА): кибербезопасность для бизнеса</i>\n"
    "— <b>Дмитрий Адмакин</b> <i>(БЦ ОПР): программирование без кода</i>\n"
    "— <b>Асель Нурмухаметова</b> <i>(БЦ Росстат): кейс для Уполномоченного по правам человека в РФ</i>\n"
    "— <b>Александр Балуков</b> <i>(БЦ Медицина): цифровая лаборатория — не миф, а продукт</i>\n"
    "— <b>Юлия Хорошутина</b> <i>(AW/AlphaBI): продуктовый подход AlphaBI и AW BI</i>\n"
    "— <b>Станислав Забегаев</b> <i>(БЦ УНП): отчёты и документы без лишней рутины</i>\n"
    "— <b>Эльвира Гильманова</b> <i>: как за 1825 дней из идеи сделать бизнес</i>"
)

fourth_part = (
    "<b>Всё. Жди первое включение — и не теряйся</b>🫰"
)
