# Данные кнопок для интерактива Забегаева

buttons_1 = {
    "Правда": "zabegayev_question_1_0",  # Неправильный ответ
    "Ложь": "zabegayev_question_1_1"     # Правильный ответ
}

buttons_2 = {
    "Правда": "zabegayev_question_2_0",  # Правильный ответ  
    "Ложь": "zabegayev_question_2_1"     # Неправильный ответ
}

# Правильные ответы для каждого вопроса
zabegayev_correct_answers = {
    1: 1,  # Правильный ответ - "Ложь" (индекс 1) - это миф
    2: 0   # Правильный ответ - "Правда" (индекс 0) - это правда
} 